import os
# ==========================================
# Bot
# ==========================================
BOT_TOKEN = os.getenv("BOT_TOKEN")
# ==========================================
# Database
# ==========================================
DATABASE_URL = os.getenv("DATABASE_URL")
# ==========================================
# Roles
# ==========================================
ADMIN_IDS = [
    8747305714,
]
TECH_SUPPORT_IDS = [
    41792255,
]
# ==========================================
# Channels
# ==========================================
CHANNEL_VITRIN = -1003945260173
CHANNEL_HAYAT = -1003854428039
CHANNEL_VITRIN_LINK = "https://t.me/vitrinspain"
CHANNEL_HAYAT_LINK = "https://t.me/hayatkhalvatspain"
# ==========================================
# Project
# ==========================================
PROJECT_NAME = "ویترین اسپانیا"
# ==========================================
# Welcome Text
# ==========================================
WELCOME_TEXT = """
🇪🇸 به ویترین اسپانیا خوش آمدی
اولین و کامل‌ترین مجموعه دیجیتالی اسپانیا برای همه فارسی‌زبانان
🟡 کانال ویترین:
https://t.me/vitrinspain
🟣 کانال حیاط خلوت:
https://t.me/hayatkhalvatspain
📌 برای مشاهده و انتشار محتوا، ابتدا عضو کانال‌ها شو.
پشتیبانی:
@VitrinSpainAdmin
"""
# ==========================================
# Subcategories
# ==========================================
SUBCATEGORIES = {
    "💼 کار و درآمد": [
        "📂 استخدام",
        "📂 جستجوی کار",
        "📂 خدمات فریلنسری",
        "📂 همکاری و مشارکت",
    ],

    "🏠 خانه و اجاره": [
        "📂 اجاره خانه",
        "📂 اجاره اتاق",
        "📂 همخانه",
        "📂 خرید و فروش ملک",
    ],

    "🛒 خرید و فروش": [
        "📂 لوازم خانه",
        "📂 موبایل و کامپیوتر",
        "📂 خودرو",
        "📂 سایر",
    ],

    "🔧 خدمات": [
        "📂 خدمات حقوقی",
        "📂 خدمات مهاجرت",
        "📂 خدمات فنی",
        "📂 سایر خدمات",
    ],

    "🚚 ارسال بار": [
        "📂 اسپانیا به ایران",
        "📂 ایران به اسپانیا",
        "📂 مسافر و بار",
    ],

    "💰 سرمایه گذاری": [
        "📂 سرمایه گذاری",
        "📂 شراکت",
        "📂 کسب و کار",
    ],

    "💶 خرید و فروش یورو": [
        "📂 خرید یورو",
        "📂 فروش یورو",
    ],

    "📢 آگهی ویژه": [
        "📂 تبلیغات",
        "📂 معرفی کسب و کار",
    ],
}
