import os

# ==========================================
# Bot
# ==========================================

BOT_TOKEN = os.getenv("BOT_TOKEN")

# ==========================================
# Database
# ==========================================

DATABASE_URL = os.getenv("DATABASE_URL")

# ==========================================
# Roles
# ==========================================

ADMIN_IDS = [
    8747305714,
]

TECH_SUPPORT_IDS = [
    41792255,
]

# ==========================================
# Channels
# ==========================================

CHANNEL_VITRIN = -1003945260173
CHANNEL_HAYAT = -1003854428039

CHANNEL_VITRIN_LINK = "https://t.me/vitrinspain"
CHANNEL_HAYAT_LINK = "https://t.me/hayatkhalvatspain"

# ==========================================
# Project
# ==========================================

PROJECT_NAME = "ویترین اسپانیا"

# ==========================================
# Welcome Text
# ==========================================

WELCOME_TEXT = """
🇪🇸 به ویترین اسپانیا خوش آمدی

بزرگ‌ترین جامعه دیجیتال فارسی‌زبانان اسپانیا

🟡 کانال ویترین:
https://t.me/vitrinspain

🟣 کانال حیاط خلوت:
https://t.me/hayatkhalvatspain

📌 برای مشاهده و انتشار محتوا، ابتدا عضو کانال‌ها شو.

پشتیبانی:
@VitrinSpainAdmin
"""
